In [ ]:
#Requests
import requests

In [ ]:
url="https://images.newindianexpress.com/uploads/user/imagelibrary/2020/3/5/w1200X800/MS_Dhoni_AP.jpg"

In [ ]:
result=requests.get(url)

In [ ]:
'''1=200=>success url
4-error 404, not found'''
result.status_code

200

In [ ]:
result

In [ ]:
file=open("Dhoni.jpg","wb")

In [ ]:
file.write(result.content)

83853

In [ ]:
file.close()

In [ ]:
url="https://graph.facebook.com/4/picture?type=large"

In [ ]:
result=requests.get(url)

In [ ]:
result.status_code

200

In [ ]:
result

In [ ]:
file=open("Mark.jpg","wb")

In [ ]:
file.write(result.content)

7768

In [ ]:
file.close()

In [ ]:
import os

In [ ]:
url="https://graph.facebook.com/{}/picture?type=large"

In [ ]:
if not "fb_displaypics" in os.listdir():
  os.mkdir("fb_displaypics")

for i in range(4,20):
  result=requests.get(url.format(i))
  with open("fb_displaypics/{}_img.jpg".format(i),"wb") as file:
    file.write(result.content)

In [ ]:
import pandas as pd

In [ ]:
df =pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()       #first five records

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].unique()

array([444, 555, 666])

In [ ]:
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
newdf=df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [ ]:
def times_3(x):
  return x*3

In [ ]:
 df['col1'].apply(times_3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [ ]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
df['col1'].sum()

10

In [ ]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [ ]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
del df['col1']
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [ ]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [ ]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [ ]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [ ]:
df.dropna()             #drops all non available values

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [ ]:
data={
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
}

df=pd.DataFrame(data)

In [ ]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [ ]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])    #We should put the col, row, value...can get max n min values so tha analysis is easy

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [ ]:
data ={'Company':['GOOGLE','GOOGLE','GOOGLE',
                    'MICROSOFT','MICROSOFT',"FB","FB"],
        'Person':['Prajna','Ajay','Sridhar sir','prajwal','sahdev',
        'Aravind','Anubhav'],
        'Sales':[200,120,340,124,243,350,560]
       }
df_1=pd.DataFrame(data)

In [ ]:
df_1

     Company       Person  Sales
0     GOOGLE       Prajna    200
1     GOOGLE         Ajay    120
2     GOOGLE  Sridhar sir    340
3  MICROSOFT      prajwal    124
4  MICROSOFT       sahdev    243
5         FB      Aravind    350
6         FB      Anubhav    560

In [ ]:
df_1.groupby('Company')

In [ ]:
by_company=df_1.groupby('Company')

In [ ]:
by_company.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FB          2.0  455.0  148.492424  350.0  402.50  455.0  507.50  560.0
GOOGLE      3.0  220.0  111.355287  120.0  160.00  200.0  270.00  340.0
MICROSOFT   2.0  183.5   84.145707  124.0  153.75  183.5  213.25  243.0

In [ ]:
by_company.mean()

           Sales
Company
FB         455.0
GOOGLE     220.0
MICROSOFT  183.5

In [ ]:
by_company.std()

                Sales
Company
FB         148.492424
GOOGLE     111.355287
MICROSOFT   84.145707

In [ ]:
by_company.min()

            Person  Sales
Company
FB         Anubhav    350
GOOGLE        Ajay    120
MICROSOFT  prajwal    124

In [ ]:
by_company.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FB          2.0  455.0  148.492424  350.0  402.50  455.0  507.50  560.0
GOOGLE      3.0  220.0  111.355287  120.0  160.00  200.0  270.00  340.0
MICROSOFT   2.0  183.5   84.145707  124.0  153.75  183.5  213.25  243.0

In [ ]:
by_company.describe().transpose()

Company              FB      GOOGLE   MICROSOFT
Sales count    2.000000    3.000000    2.000000
      mean   455.000000  220.000000  183.500000
      std    148.492424  111.355287   84.145707
      min    350.000000  120.000000  124.000000
      25%    402.500000  160.000000  153.750000
      50%    455.000000  200.000000  183.500000
      75%    507.500000  270.000000  213.250000
      max    560.000000  340.000000  243.000000

In [ ]:
by_company.describe().transpose()['GOOGLE']

Sales  count      3.000000
       mean     220.000000
       std      111.355287
       min      120.000000
       25%      160.000000
       50%      200.000000
       75%      270.000000
       max      340.000000
Name: GOOGLE, dtype: float64

In [ ]:
!git clone https://github.com/aniforverizon/nitte_data

Cloning into 'nitte_data'...
remote: Enumerating objects: 5, done.
remote: Counting objects: 100% (5/5), done.
remote: Compressing objects: 100% (4/4), done.
remote: Total 5 (delta 0), reused 5 (delta 0), pack-reused 0
Unpacking objects: 100% (5/5), done.

In [ ]:
!ls

Dhoni.jpg  fb_displaypics  Mark.jpg  nitte_data  sample_data

In [ ]:
!ls nitte_data

example  Excel_Sample.xlsx  multi_index_example

In [ ]:
!cat nitte_data/example

a,b,c,d
0,1,2,3
4,5,6,7
8,9,10,11
12,13,14,15

In [ ]:
!cat nitte_data/ multi_index_example

cat: nitte_data/: Is a directory
cat: multi_index_example: No such file or directory

In [ ]:
df_file=pd.read_csv('nitte_data/example')

In [ ]:
df_file

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
df_file.to_csv('example',index=False)

In [ ]:
!ls nitte_data

example  Excel_Sample.xlsx  multi_index_example

In [ ]:
pd.read_excel('nitte_data/Excel_Sample.xlsx',)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [ ]:
df=pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [ ]:
df

[                             Bank Name  ...       Closing Date
 0                 The First State Bank  ...      April 3, 2020
 1                   Ericson State Bank  ...  February 14, 2020
 2     City National Bank of New Jersey  ...   November 1, 2019
 3                        Resolute Bank  ...   October 25, 2019
 4                Louisa Community Bank  ...   October 25, 2019
 ..                                 ...  ...                ...
 556                 Superior Bank, FSB  ...      July 27, 2001
 557                Malta National Bank  ...        May 3, 2001
 558    First Alliance Bank & Trust Co.  ...   February 2, 2001
 559  National State Bank of Metropolis  ...  December 14, 2000
 560                   Bank of Honolulu  ...   October 13, 2000

 [561 rows x 6 columns]]

In [ ]:
df[0]

                             Bank Name  ...       Closing Date
0                 The First State Bank  ...      April 3, 2020
1                   Ericson State Bank  ...  February 14, 2020
2     City National Bank of New Jersey  ...   November 1, 2019
3                        Resolute Bank  ...   October 25, 2019
4                Louisa Community Bank  ...   October 25, 2019
..                                 ...  ...                ...
556                 Superior Bank, FSB  ...      July 27, 2001
557                Malta National Bank  ...        May 3, 2001
558    First Alliance Bank & Trust Co.  ...   February 2, 2001
559  National State Bank of Metropolis  ...  December 14, 2000
560                   Bank of Honolulu  ...   October 13, 2000

[561 rows x 6 columns]